Store/src/AccumulationRegisters/Товары/Товары.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>Товары</name>
  <resources>
    <name>Количество</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>Сумма</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Номенклатура</name>
    <type>
      <types>CatalogRef.Номенклатура</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Склад</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

Store/src/AccumulationRegisters/Товары/ManagerModule.bsl
// Функция возвращает остаток по переданной номенклатуре и складам в виде соответствия, где ключ - склад,
// а значение - количество остатка на данном складе.
//
// Параметры:
//  Номенклатура - СправочникСсылка.Номенклатура - номенклатура, остатки которой необходимо получить.
//  Склады - Массив Из Строка - склады, остатки которых необходимо получить.
//
// Возвращаемое значение:
//  Соответствие - соответствие складов и количества остатка на данном складе:
//   * Ключ - Строка - наименование склада.
//   * Значение - Число - количество остатка на данном складе.
//
Функция ПолучитьОстаткиПоНоменклатуре(Номенклатура, Склады) Экспорт

	Остатки = Новый Соответствие;
	
	Для Каждого Склад Из Склады Цикл
		Запрос = Новый Запрос;
		Запрос.Текст =
		"ВЫБРАТЬ
		|	ТоварыОстатки.Склад КАК Склад,
		|	ТоварыОстатки.КоличествоОстаток КАК Количество
		|ИЗ
		|	РегистрНакопления.Товары.Остатки(, 
		|		Номенклатура = &Номенклатура И Склад = &Склад) КАК ТоварыОстатки";
		Запрос.УстановитьПараметр("Номенклатура", Номенклатура);
		Запрос.УстановитьПараметр("Склад", Склад);
		Результат = Запрос.Выполнить().Выбрать();
		Если Результат.Следующий() Тогда
			Остатки.Вставить(Результат.Склад, Результат.Количество);
		Иначе
			Остатки.Вставить(Склад, 0);
		КонецЕсли;
	КонецЦикла;

	Возврат Остатки;

КонецФункции
